profiling/results/stage-3_wrk_put.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.408ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.398ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.59ms    2.49ms  42.59ms   94.13%
    Req/Sec   531.38    152.28     1.55k    78.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.09ms
 75.000%    2.69ms
 90.000%    3.74ms
 99.000%   12.41ms
 99.900%   33.06ms
 99.990%   39.52ms
 99.999%   42.62ms
100.000%   42.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.387     0.000000            1         0.00
       1.266     0.100000         5007 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.512     0.200000        10003         0.00
       1.709     0.300000        15003        -0.00
       1.896     0.400000        20004        -0.00
       2.085     0.500000        25004         0.00
       2.181     0.550000        27477 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.289     0.600000        29997         0.00
       2.399     0.650000        32483        -0.00
       2.531     0.700000        34972        -0.00
       2.691     0.750000        37487         0.00
       2.789     0.775000        38724 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.899     0.800000        39962         0.00
       3.031     0.825000        41218        -0.00
       3.199     0.850000        42472        -0.00
       3.421     0.875000        43720         0.00
       3.563     0.887500        44338 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       3.741     0.900000        44965         0.00
       3.995     0.912500        45582        -0.00
       4.331     0.925000        46206        -0.00
       4.891     0.937500        46834         0.00
       5.243     0.943750        47143 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       5.647     0.950000        47458         -nan
       6.175     0.956250        47768        -0.00
       6.791     0.962500        48082        -0.00
       7.371     0.968750        48395         0.00
       7.691     0.971875        48551 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       8.231     0.975000        48705         -nan
       8.743     0.978125        48861        -0.00
       9.271     0.981250        49016        -0.00
       9.991     0.984375        49172         0.00
      10.487     0.985938        49251 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
      11.055     0.987500        49328         0.00
      11.751     0.989062        49406        -0.00
      12.903     0.990625        49484        -0.00
      14.503     0.992188        49562         0.00
      15.623     0.992969        49601 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      16.639     0.993750        49640         0.00
      18.287     0.994531        49679        -0.00
      19.871     0.995313        49718        -0.00
      21.871     0.996094        49757         0.00
      23.359     0.996484        49777 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      24.527     0.996875        49796         -nan
      26.047     0.997266        49816        -0.00
      27.023     0.997656        49835        -0.00
      28.735     0.998047        49855         0.00
      29.391     0.998242        49865 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      30.447     0.998437        49874         -nan
      31.567     0.998633        49885        -0.00
      32.047     0.998828        49894        -0.00
      33.119     0.999023        49904         0.00
      33.823     0.999121        49909 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      34.335     0.999219        49913         0.00
      34.815     0.999316        49918        -0.00
      35.487     0.999414        49923        -0.00
      36.063     0.999512        49928         0.00
      36.383     0.999561        49931 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      36.511     0.999609        49933         0.00
      36.799     0.999658        49935        -0.00
      37.407     0.999707        49938        -0.00
      38.111     0.999756        49940         0.00
      38.207     0.999780        49942 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      38.303     0.999805        49943         -nan
      38.335     0.999829        49944        -0.00
      38.687     0.999854        49945        -0.00
      39.519     0.999878        49947         0.00
      39.519     0.999890        49947 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      40.447     0.999902        49948         -nan
      40.447     0.999915        49948        -0.00
      41.055     0.999927        49949        -0.00
      41.055     0.999939        49949         0.00
      41.951     0.999945        49950 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      41.951     0.999951        49950         0.00
      41.951     0.999957        49950        -0.00
      42.463     0.999963        49951        -0.00
      42.463     0.999969        49951         0.00
      42.463     0.999973        49951 1197515777994123122827113180149268934166040916797761874901295891084783746657345444054174008110143315617531302687800938125050062129397660703838339185309575766350416028682216846776156215216348189439851718800547092882496686463674426196563591168.00
      42.463     0.999976        49951         0.00
      42.463     0.999979        49951        -0.00
      42.623     0.999982        49952        -0.00
      42.623     1.000000        49952         0.00
#[Mean    =        2.590, StdDeviation   =        2.486]
#[Max     =       42.592, Total count    =        49952]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  59969 requests in 1.00m, 3.83MB read
Requests/sec:    999.03
Transfer/sec:     65.37KB